state/testdata/dot/document.dot
digraph "document" {
    rankdir=LR;
    node [shape=box, style=rounded];
    __start [shape=point];
    __start -> "Draft";
    "Draft" [style="rounded,filled", fillcolor="#f0d9ff"];
    "Submitted" [style="rounded,filled", fillcolor="#f0d9ff"];
    "Approved" [style="rounded,filled", fillcolor="#ffd6e0"];
    "Published" [style="rounded,filled", fillcolor="#ffd6e0"];
    "Archived" [style="rounded,filled", fillcolor="#f0d9ff"];
    "Approved" -> "Published" [label="Publish"];
    "Draft" -> "Archived" [label="Archive"];
    "Draft" -> "Submitted" [label="Submit"];
    "Submitted" -> "Approved" [label="Approve [hasReviewer]"];
    "Submitted" -> "Archived" [label="Archive"];
    "Submitted" -> "Draft" [label="RequestChanges"];
}
